In [1]:
import pandas as pd

In [2]:
df = pd.read_csv(r"C:\\Users\\omkar\\Downloads\\income.csv")

In [3]:
df.head()

   id  age  income occupation  years_of_experience
0   1   25   30000   Engineer                    2
1   2   30   45000     Doctor                    5
2   3   25   32000   Engineer                    3
3   4   35   50000    Teacher                    7
4   5   40   60000    Manager                   10

In [4]:
df.tail()

    id  age  income occupation  years_of_experience
15  16   45   70000     Lawyer                   15
16  17   50   75000  Scientist                   20
17  18   45   73000     Lawyer                   14
18  19   50   78000  Scientist                   22
19  20   45   71000     Lawyer                   16

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 5 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   id                   20 non-null     int64
 1   age                  20 non-null     int64
 2   income               20 non-null     int64
 3   occupation           20 non-null     object
 4   years_of_experience  20 non-null     int64
dtypes: int64(4), object(1)
memory usage: 932.0+ bytes

In [6]:
print(df.shape)
print(df.size)
print(df.ndim)
print(df.columns)

(20, 5)
100
2
Index(['id', 'age', 'income', 'occupation', 'years_of_experience'], dtype='object')

In [7]:
print(df.isnull())
print(df.isna())
print(df.isna().sum())

       id    age  income  occupation  years_of_experience
0   False  False   False       False                False
1   False  False   False       False                False
2   False  False   False       False                False
3   False  False   False       False                False
4   False  False   False       False                False
5   False  False   False       False                False
6   False  False   False       False                False
7   False  False   False       False                False
8   False  False   False       False                False
9   False  False   False       False                False
10  False  False   False       False                False
11  False  False   False       False                False
12  False  False   False       False                False
13  False  False   False       False                False
14  False  False   False       False                False
15  False  False   False       False                False
16  False  False   False       False                False
17  False  False   False       False                False
18  False  False   False       False                False
19  False  False   False       False                False
       id    age  income  occupation  years_of_experience
0   False  False   False       False                False
1   False  False   False       False                False
2   False  False   False       False                False
3   False  False   False       False                False
4   False  False   False       False                False
5   False  False   False       False                False
6   False  False   False       False                False
7   False  False   False       False                False
8   False  False   False       False                False
9   False  False   False       False                False
10  False  False   False       False                False
11  False  False   False       False                False
12  False  False   False       False                False
13  False  False   False       False                False
14  False  False   False       False                False
15  False  False   False       False                False
16  False  False   False       False                False
17  False  False   False       False                False
18  False  False   False       False                False
19  False  False   False       False                False
id                     0
age                    0
income                 0
occupation             0
years_of_experience    0
dtype: int64

In [8]:
categorical_col = "age"  # Change this to your categorical column
numerical_col = "income"  # Change this to your numerical column

# Check for missing values and fill them if necessary
df[numerical_col] = df[numerical_col].fillna(df[numerical_col].median())

# Compute summary statistics grouped by the categorical column
summary_stats = df.groupby(categorical_col)[numerical_col].agg(
    mean="mean",
    median="median",
    min="min",
    max="max",
    std="std"
)

In [9]:
print("\nSummary Statistics:")
print(summary_stats)

Summary Statistics:
             mean   median    min    max          std
age
25   32000.000000  32000.0  30000  34000  1581.138830
30   45500.000000  45500.0  44000  47000  1290.994449
35   51000.000000  51000.0  50000  52000  1000.000000
40   61000.000000  61000.0  60000  62000  1000.000000
45   71333.333333  71000.0  70000  73000  1527.525232
50   76500.000000  76500.0  75000  78000  2121.320344

In [10]:
grouped_values = df.groupby(categorical_col)[numerical_col].apply(list)

In [11]:
print("\nGrouped Values as List:")
print(grouped_values)

Grouped Values as List:
age
25    [30000, 32000, 31000, 33000, 34000]
30           [45000, 47000, 46000, 44000]
35                  [50000, 52000, 51000]
40                  [60000, 61000, 62000]
45                  [70000, 73000, 71000]
50                         [75000, 78000]
Name: income, dtype: object